{
  "work_experience": [
    {
      "title": "Web Developer",
      "company": "Digital Telepathy",
      "location": "San Diego, CA",
      "when": "May 2014 – Present",
      "is_current": "true",
      "description": "Developed responsive marketing sites featuring rich user interactions built in HTML, CSS and JavaScript. Built WordPress themes and plugins from scratch, as well as contributed to high traffic sites such as Tim Ferris’s blog on WordPress VIP. \n Contributed to the front-end development (CSS and AngularJS) of Filament, the company’s blog analytics web application, as well as the Filament WordPress plugin and marketing site."
    },
    {
      "title": "Web Developer & Graphic Designer ",
      "company": "Freelance",
      "location": "Solana Beach, CA",
      "when": "March 2013 - May 2015",
      "description": "Developed custom WordPress site for new San Diego coupon publication. Programming involved creation of complex custom post types and database relationships. Also developed custom widgets and plugins for the new site.\n Managed content creation of the site including blog posts, social media updates and calendar of events.\n Managed and created newsletter campaigns for the newly launched site."
    },
    {
      "title": "Web Designer & Developer",
      "company": "Studio 2055",
      "location": "Carlsbad, CA",
      "when": "May 2013 – Sept 2013",
      "description": "Developed new studio website using the Genesis framework in WordPress. Features included portfolio of case studies that allowed for flexible content, as well as a responsive design. \n Designed and developed websites for studio clients. Designed banner ads, presentations and other graphics for client work. \nUpdated, maintained and improved SEO on existing client websites."
    },
    {
      "title": "Web Developer & Graphic Designer",
      "company": "Active Gaming Media Inc.",
      "location": "Osaka, Japan",
      "when": "June 2012 – Jan 2013",
      "description": "Co-designed and developed new SEO-friendly corporate website with a custom-built CMS from scratch using Ruby on Rails.\n Designed elaborate, creative promotional campaigns for PLAYISM, an online international indie game portal.\n Designed banners, logos, assets, and web pages.\n Edited videos for client advertisements."
    }
  ]
}